{
  "title": "Chicken Peanut Stew",
  "subtitle": "Makes 2 servings. Great over rice.",
  "sections": [
    {
      "title": "You will need",
      "list": [
        "Red Bell Pepper – 1",
        "Onion – 1",
        "Plum Tomato – 3",
        "Baby Spinach – 1/2 lb",
        "Lime – 2",
        "Ginger Paste",
        "Garlic Paste",
        "Sesame Oil",
        "Chili Powder",
        "Brown Sugar or Honey",
        "Peanut Butter Powder",
        "Chicken Thighs – 2",
        "Broth or Stock – 2 C"
      ]
    },
    {
      "title": "Marinate the chicken",
      "list": [
        "Wash, dry, and zest the limes into your marinating vessel and cut them in half.",
        "Combine the 2 TBSP oil, 1 tsp sesame oil, the zest of the whole lime and juice of half, ginger, garlic, 2 tsp brown sugar or honey, 1 tsp salt, lots of black pepper, and 1/2 tsp chili powder.",
        "Slice the chicken into bite-size pieces. Marinate the chicken for at least 15 minutes."
      ]
    },
    {
      "title": "Prep",
      "list": [
        "Wash and dry produce.",
        "Dice tomatoes.",
        "Slice onion and pepper into bite-size pieces.",
        "Measure 2 cups of stock.",
        "Measure 4 TBSP (or 1/4 cup) peanut butter powder.",
        "Measure 1/2 pound spinach."
      ]
    },
    {
      "title": "Cook",
      "list": [
        "Sear the chicken. Heat a pan over medium-high heat and add the chicken mixture. Let it cook undisturbed for two minutes, then turn the mixture and cook for another two minutes to brown. Stir and continue cooking for five more minutes, stirring occasionally.",
        "Cook the vegetables. Set the chicken aside and cook the onions and peppers until soft and translucent—up to 7 minutes.",
        "Add aromatics. If adding more garlic, do it now. Cook until fragrant.",
        "Simmer the stew. Add the broth, peanut butter powder, chicken, and tomatoes. Bring to a boil, reduce to a simmer, and cook uncovered for 20–25 minutes.",
        "Adjust seasoning. Taste and add salt, pepper, chili powder, or brown sugar as needed.",
        "Add spinach. Stir it in and turn off the heat once wilted.",
        "Finish with lime. Squeeze in fresh lime juice before serving."
      ]
    }
  ]
}